[
	{
		"title": "Old Jules",
		"authorFirst": "Mari", 
		"authorLast": "Sandoz",
		"published": "", 
		"genre": "",
		"yearConsumed": "2022",
		"notes": "What a fantastic prompt for me to write up a brief book review! I recently finished reading Mari Sandoz`s Old Jules: a biography of Mari's father and of western Nebraska from the 1880s through the 1930s. As many reviewers state, this is an unromanticized depiction of both her father and the land. A highly-recommended read for anyone from Nebraska, interested in pioneer history, or appreciative of good writing. Jules was, in many ways, larger than life. He had a strong personality and will, which (during his rages) his family was often the unfortunate recipients of. He had an unquenchable vision of optimism about this `raw` land in the old west. In which the settler had endless opportunity for a prosperous life, so long as the powerful cattlemen and overreaching government stayed in their place. I also have a personal connection to this book and author. My grandma Lois was inspired by Sandoz and her writing. Unfortunately, she couldn`t finish her own biography of Mari Sandoz before she lost her mind to Alzheimer's. But reading this book gave me a special connection to what my own grandma was trying to create in her own writing vision."
	}, {
		"title": "Foundation",
		"authorFirst": "Isaac", 
		"authorLast": "Asimov",
		"published": "", 
		"genre": "SciFi",
		"yearConsumed": "2022",
		"notes": "Jim invented such a great voice for Hober Mallow! Kinda southern drawl. So so so so so good. Review: I recently finished reading the first book in Isaac Asimov's Foundation series. This is my first time reading this classic of scifi. (Gotta read the books if Apple's making a tv show.) For any who don't know, this series is an epic tome of a dying galactic empire's future history. Asimov's simple prose and story lines employ some of my favorite scifi tropes: using technological advances as a lens to explore the human condition. Countless reviews (both good and bad) can be found online. Bonus points if you can find someone to read this to you before bed (and if characters get their own voices)."
	}, 
	{
		"title": "The Buried Giant",
		"authorFirst": "Kazuo", 
		"authorLast": "Ishiguro",
		"published": "", 
		"genre": "Fantasy",
		"yearConsumed": "2022",
		"notes": "British fantasy with a twist. Got it for Christmas. Jim and I each finished in March. A strange exploration of memory and trauma and fantasy concepts. Some of the writing structure elements frustrated me earlier on (jumping backwards and forwards in time was hard to track). But the overall story was very good, very complex, quite enjoyable."
	},
	{
		"title": "Sovereign Erotics: A Collection of Two-Spirit Literature",
		"authorFirst": "First Peoples: ", 
		"authorLast": "New Directions in Indigenous Studies",
		"published": "", 
		"genre": "",
		"yearConsumed": "2022",
		"notes": "Read a smattering of the poems and short stories. A fun insight to a different and important perspective."
	},
	{
		"title": "Foundaton and Empire",
		"authorFirst": "Isaac", 
		"authorLast": "Asimov",
		"published": "", 
		"genre": "SciFi",
		"yearConsumed": "2022",
		"notes": "second in foundation series. Jim read to me at bedtime, but I increasingly fall asleep too fast!"
	},
	{
		"title": "PhD Dissertation",
		"authorFirst": "wife of Chris", 
		"authorLast": "Kiser (BT Coworker)",
		"published": "", 
		"genre": "",
		"yearConsumed": "2022",
		"notes": "Thesis: In Victorian era, women poets` work and gender role shaped by the emergence of photography as a technology and as an artform (whaaa?!?)"
	},
	{
		"title": "Exhalation",
		"authorFirst": "Ted", 
		"authorLast": "Chiang",
		"published": "", 
		"genre": "",
		"yearConsumed": "2022",
		"notes": "collection of short stories. Jim read some to me before bed."
	},
	{
		"title": "Children of Time",
		"authorFirst": "Adrian", 
		"authorLast": "Tchaikovsky",
		"published": "", 
		"genre": "SciFi",
		"yearConsumed": "2022",
		"notes": "Debbie recommend; get for Christmas; both Jim and I breeze through: action packed!"
	},
	{
		"title": "",
		"authorFirst": "", 
		"authorLast": "",
		"published": "", 
		"genre": "",
		"yearConsumed": "",
		"notes": ""
	}
]
